jcfain/TCodeESP32/ESP32/src/messages/SystemCommandHandler.h
/* MIT License

Copyright (c) 2024 Jason C. Fain

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE. */

#pragma once

#include <Arduino.h>
#if ESP8266 == 1
#include <ESP8266WiFi.h>
#else
#include <WiFi.h>
#endif
#include "settings/SettingsHandler.h"
#include "utils.h"
#include "logging/LogHandler.h"
#include "logging/TagHandler.h"
#include "struct/command.hpp"
#include "settingsFactory.h"
#include "TCode/MotorHandler.h"

class SystemCommandHandler
{
public:
	SystemCommandHandler()
	{
		tCodeQueue = xQueueCreate(10, sizeof(char[MAX_COMMAND]));
		if (tCodeQueue == NULL)
		{
			LogHandler::error(Tags::SystemCommand, "Error creating the tcode queue");
		}
		m_settingsFactory = SettingsFactory::getInstance();
	}
	bool process(const char *in)
	{
		xSemaphoreTake(xMutex, portMAX_DELAY);
		if (isSaveCommand(in))
		{
			LogHandler::debug(Tags::SystemCommand, "Enter process save command: %s", in);
			for (Command command : saveCommands)
			{
				if (match(in, command.command))
				{
					command.callback();
					xSemaphoreGive(xMutex);
					return true;
				}
			}

			LogHandler::error(Tags::SystemCommand, "Unknown save command: %s\n", in);
			xSemaphoreGive(xMutex);
			return false;
		}
		else if (isOtherCommand(in))
		{
			LogHandler::debug(Tags::SystemCommand, "Enter process other command: %s", in);

			for (auto command : commands)
			{
				if (match(in, command.command))
				{
					command.callback();
					xSemaphoreGive(xMutex);
					return true;
				}
			}

			for (auto command : commandExternal)
			{
				if (startsWith(in, command.command))
				{
					command.callback(in);
					xSemaphoreGive(xMutex);
					return true;
				}
			}
			CommandValuePair valuePair;
			if (!getCommandValue(in, valuePair))
				return false;

			LogHandler::debug(Tags::SystemCommand, "Value command: %s:%s", valuePair.command, valuePair.value);
			for (auto command : commandCharValues)
			{
				if (match(valuePair.command, command.command))
				{
					command.callback(valuePair.value);
					xSemaphoreGive(xMutex);
					return true;
				}
			}

			for (auto command : commandNumberValues)
			{
				if (match(valuePair.command, command.command))
				{
					bool error = false;
					int valueInt = getInt(valuePair.value, error);
					if (error)
						return false;
					command.callback(valueInt);
					xSemaphoreGive(xMutex);
					return true;
				}
			}

			LogHandler::error(Tags::SystemCommand, "Unknown command: %s", in);
			xSemaphoreGive(xMutex);
			return false;
		}
		xSemaphoreGive(xMutex);
		return false;
	}

	// bool process(ButtonModel* button, char buf[MAX_COMMAND]) {
	// 	buf[0] = {0};
	// 	for(auto command : commandExternal) {
	// 		if(match(button->command, command.command)) {
	// 			strlcpy(buf, button->command, MAX_COMMAND);
	// 			button->isPressed() ? strcat(buf, ":1\n") : strcat(buf, ":0\n");
	// 			return true;
	// 		}
	// 	}
	// 	if(!button->isPressed()) {// Filter out other commands button release event for now.
	// 		strlcpy(buf, button->command, MAX_COMMAND);
	// 	}
	// 	return false;
	// }

	/// @brief This function is mainly for concatenating the button state for commands sent externally.
	/// @param button
	/// @param buf
	/// @return true if any commands where added.
	bool process(ButtonModel *button, char buf[MAX_COMMAND])
	{
		LogHandler::debug(Tags::SystemCommand, "Enter process button command: %s", button->command);
		char temp[MAX_COMMAND];
		strlcpy(temp, button->command, MAX_COMMAND);
		char *token = strtok(temp, " "); // Split incoming at TCode delemiter "space"
		buf[0] = {0};
		while (token != NULL)
		{ // Specify if the button is pressed or released only for externaly sent commands.
			LogHandler::debug(Tags::SystemCommand, "Searching command: %s", token);
			bool externalFound = false;
			for (auto command : commandExternal)
			{
				if (match(command.command, token))
				{
					strcat(buf, token);
					button->isPressed() ? strcat(buf, ":1") : strcat(buf, ":0");
					externalFound = true;
					break;
				}
			}
			if (!externalFound && !button->isPressed())
			{ // Add other commands only if the button has been released for now.
				strcat(buf, token);
			}
			strcat(buf, " ");
			token = strtok(NULL, " ");
		}
		if (strlen(buf))
		{
			strcat(buf, "\n");
			LogHandler::debug(Tags::SystemCommand, "Finish process button command: %s", buf);
			return true;
		}
		return false;
	}

	bool isCommand(const char *in)
	{
		return isSaveCommand(in) || isOtherCommand(in);
		// return strpbrk(DELEMITER_SAVE, in) != nullptr || strpbrk(DELEMITER, in) != nullptr;
	}

	bool isSaveCommand(const char *in)
	{
		return startsWith(in, DELEMITER_SAVE);
	}

	bool isOtherCommand(const char *in)
	{
		return startsWith(in, DELEMITER);
	}
	bool isValueCommand(const char *in)
	{
		return contains(in, (&DELEMITER_VALUE));
	}

	bool isSettingCommand(const char *in)
	{
		return startsWith(in, DELEMITER);
	}

	void registerExternalCommandCallback(std::function<void(const char *)> callback)
	{
		m_externalCommandCallback = callback;
	}

	bool getTCode(char *buf)
	{
		if (!tCodeQueue)
		{
			return false;
		}
		if (!xQueueReceive(tCodeQueue, buf, 0))
		{
			buf[0] = {0};
			return false;
		}
		return true;
	}

