jcfain/TCodeESP32/ESP32/src/messages/SystemCommandHandler.h
private:
	SemaphoreHandle_t xMutex = xSemaphoreCreateMutex();
	QueueHandle_t tCodeQueue;
	SettingsFactory *m_settingsFactory;
	std::function<void(const char *)> m_externalCommandCallback = 0;
	std::function<void(const char *)> m_otherCommandCallback = 0;

	const char *DELEMITER = "#";
	const char *DELEMITER_SAVE = "$";
	const char DELEMITER_VALUE = ':';
	const Command HELP{{"Help", "#help", "Print the help screen", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
					   {
						   return execute([this]() -> bool
										  {
			printCommandHelp();
			return true; });
					   }};
	const Command AVAILABLE_SETTINGS{{"List settings", "#list-settings", "Print the available settings for the #setting command", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
									 {
										 return execute([this]() -> bool
														{
			printAvailableSettings();
			return true; });
									 }};
	const Command PRINT_MEMORY{{"Print memory", "#print-mem", "Print the system memory info to serial", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
							   {
								   return execute([this]() -> bool
												  {
			SettingsHandler::printFree(true);
			return true; });
							   }};
	const Command SAVE{{"Save", "$save", "Saves all settings", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
					   {
						   return execute([this]() -> bool
										  {
			SettingsHandler::saveAll();
			Serial.println("Settings saved!");
			return true; });
					   }};
	const Command DEFAULT_ALL{{"Default all", "$defaultAll", "Saves all settings to default", SaveRequired::NO, RestartRequired::YES, SettingType::NONE}, [this]() -> bool
							  {
								  return execute([this]() -> bool
												 {
			if(!m_settingsFactory->resetAll()) {
				LogHandler::error(Tags::SystemCommand, "Error resetting all to default");
				return false;
			}
			LogHandler::info(Tags::SystemCommand, "All settings reset to default!");
			return true; }, SaveRequired::NO, RestartRequired::YES);
							  }};
	const Command RESTART{{"Restart", "#restart", "Restart the system", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
						  {
							  return execute([]() -> bool
											 {
			SettingsHandler::restart();
			return true; });
						  }};
	const Command REAPPLY_PWM{ {"Reapply PWM", "#reapply-pwm", "Hot-reattach all PWM outputs from current settings without rebooting", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
							  {
								  return execute([]() -> bool
												 {
			LogHandler::info(Tags::SystemCommand, "Requesting PWM hot-reattach");
			MotorHandler::requestReapply();
			return true; });
							  } };
	const Command PRINT_IP{{"Print IP", "#ip", "Print current STA or AP IP address", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
						   {
							   return execute([]() -> bool
											  {
			IPAddress ip = (WiFi.isConnected()) ? WiFi.localIP() : WiFi.softAPIP();
			Serial.printf("IP Address: %s\n", ip.toString().c_str());
			return true; });
						   }};
	const Command CLEAR_LOGS_INCLUDE{{"Clear log include", "#clear-log-include", "Clears all the log included tags", SaveRequired::YES, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
									 {
										 return execute([this]() -> bool
														{
			LogHandler::clearIncludes();
			LogHandler::debug(Tags::SystemCommand, "Tags cleared");
			return m_settingsFactory->setValue(LOG_INCLUDETAGS, "") != SettingFile::NONE; }, SaveRequired::YES);
									 }};
	const Command CLEAR_LOGS_EXCLUDE{{"Clear log exclude", "#clear-log-exclude", "Clears all the log excluded tags", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
									 {
										 return execute([this]() -> bool
														{
			LogHandler::clearExcludes();
			LogHandler::debug(Tags::SystemCommand, "Filters cleared");
			return m_settingsFactory->setValue(LOG_EXCLUDETAGS, "") != SettingFile::NONE; }, SaveRequired::NO);
									 }};
	const Command CHANNEL_RANGES_ENABLE{{"Channel ranges enable", "#channel-ranges-enable", "Enables the channel range limits temporarily", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
										{
											return validateBool("Channel ranges", true, SettingsHandler::getChannelRangesEnabled(), [this](bool value) -> bool
																{
			SettingsHandler::setChannelRangesEnabled(true);
			LogHandler::debug(Tags::SystemCommand, "Channel ranges enabled");
			return true; });
										}};
	const Command CHANNEL_RANGES_DISABLE{{"Channel ranges disable", "#channel-ranges-disable", "Disables the channel range limits temporarily", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
										 {
											 return validateBool("Channel ranges", false, SettingsHandler::getChannelRangesEnabled(), [this](bool value) -> bool
																 {
			SettingsHandler::setChannelRangesEnabled(false);
			LogHandler::debug(Tags::SystemCommand, "Channel ranges disabled");
			return true; });
										 }};
	const Command CHANNEL_RANGES_TOGGLE{{"Channel ranges toggle", "#channel-ranges-toggle", "Toggles the channel range limits temporarily", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
										{
											return execute([this]() -> bool
														   {
			bool enabled = SettingsHandler::getChannelRangesEnabled();
			SettingsHandler::setChannelRangesEnabled(!enabled);
			LogHandler::debug(Tags::SystemCommand, !enabled ? "Channel ranges enabled" : "Channel ranges disabled");
			return true; });
										}};
	const Command MOTION_ENABLE{{"Motion enable", "#motion-enable", "Enables the motion generator", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
								{
									return validateBool("Motion", true, SettingsHandler::getMotionEnabled(), [this](bool value) -> bool
														{
			SettingsHandler::setMotionEnabled(value);
			LogHandler::debug(Tags::SystemCommand, "Motion enabled");
			return true; });
								}};
	const Command MOTION_DISABLE{{"Motion disable", "#motion-disable", "Disables the motion generator", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
								 {
									 return validateBool("Motion", false, SettingsHandler::getMotionEnabled(), [this](bool value) -> bool
														 {
			SettingsHandler::setMotionEnabled(value);
			LogHandler::debug(Tags::SystemCommand, "Motion disabled");
			writeTCode("DSTOP\n");
			return true; });
								 }};
	const Command MOTION_TOGGLE{{"Motion toggle", "#motion-toggle", "Toggles the motion generator", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
								{
									return execute([this]() -> bool
												   {
			bool enabled = SettingsHandler::getMotionEnabled();
			SettingsHandler::setMotionEnabled(!enabled);
			LogHandler::debug(Tags::SystemCommand, !enabled ? "Motion enabled" : "Motion disabled");
			if(!enabled) {
				writeTCode("DSTOP\n");
			}
			return true; });
								}};
	const Command MOTION_HOME{{"Motion home", "#device-home", "Sends all axis' to its home position", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
							  {
								  char buf[MAX_COMMAND];
								  SettingsHandler::channelMap.tCodeHome(buf);
								  LogHandler::debug(Tags::SystemCommand, "Device home: %s", buf);
								  writeTCode(buf);
								  return true;
							  }};
	const Command MOTION_PROFILE_CYCLE{{"Motion profile cycle", "#motion-profile-cycle", "Cycles the motion generator profiles stopping after last profile", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this]() -> bool
									   {
										   return execute([this]() -> bool
														  {
			SettingsHandler::cycleMotionProfile();
			return true; });
									   }};
	const Command PAUSE{{"Pause", "#pause", "Pauses all motion of the device", SaveRequired::YES, RestartRequired::YES, SettingType::NONE}, [this]() -> bool
						{
							return execute([this]() -> bool
										   {
			SettingsHandler::motionPaused = true;
			LogHandler::debug(Tags::SystemCommand, "Device paused");
			return true; });
							return true;
						}};
	const Command RESUME{{"Resume", "#resume", "Resumes all motion of the device", SaveRequired::YES, RestartRequired::YES, SettingType::NONE}, [this]() -> bool
						 {
							 return execute([this]() -> bool
											{
			SettingsHandler::motionPaused = false;
			LogHandler::debug(Tags::SystemCommand, "Device resumed");
			return true; });
							 return true;
						 }};
	const Command PAUSE_TOGGLE{{"Pause toggle", "#pause-toggle", "Pauses all motion of the device", SaveRequired::YES, RestartRequired::YES, SettingType::NONE}, [this]() -> bool
							   {
								   return execute([this]() -> bool
												  {
			SettingsHandler::motionPaused = !SettingsHandler::motionPaused;
			LogHandler::debug(Tags::SystemCommand, SettingsHandler::motionPaused ? "Device paused" : "Device resumed");
			return true; });
								   return true;
							   }};
	const CommandValue<const int> MOTION_HOME_SPEED{{"Motion home", "#device-home", "Sends all axis' to its home position at specified speed (S)", SaveRequired::NO, RestartRequired::NO, SettingType::Number}, [this](const int value) -> bool
													{
														char buf[MAX_COMMAND];
														SettingsHandler::channelMap.tCodeHome(buf, value);
														LogHandler::debug(Tags::SystemCommand, "Device home speed: %s", buf);
														writeTCode(buf);
														return true;
													}};
	const CommandValue<const char *> WIFI_SSID{{"Wifi ssid", "#wifi-ssid", "Sets the ssid of the wifi AP", SaveRequired::YES, RestartRequired::YES, SettingType::String}, [this](const char *value) -> bool
											   {
												   return validateMaxLength("Wifi SSID", value, SSID_LEN, false, [this](const char *value) -> bool
																			{
			m_settingsFactory->setValue(SSID_SETTING, value);
			//strcpy(SettingsHandler::ssid, value);
			return true; }, SaveRequired::YES, RestartRequired::YES);
											   }};
	const CommandValue<const char *> WIFI_PASS{{"Wifi pass", "#wifi-pass", "Sets the password of the wifi AP", SaveRequired::YES, RestartRequired::YES, SettingType::String}, [this](const char *value) -> bool
											   {
												   return validateMaxLength("Wifi password", value, WIFI_PASS_LEN, true, [this](const char *value) -> bool
																			{
			m_settingsFactory->setValue(WIFI_PASS_SETTING, value);
			//strcpy(SettingsHandler::wifiPass, value);
			return true; }, SaveRequired::YES, RestartRequired::YES);
											   }};
	const CommandValue<const int> BOARD_TYPE{{"Board type", "#board-type", BOARD_TYPES_HELP, SaveRequired::YES, RestartRequired::YES, SettingType::Number}, [this](const int value) -> bool
											 {
												 return executeValue<const int>(value, [this](const int value) -> bool
																				{ return m_settingsFactory->changeBoardType(value); }, SaveRequired::YES);
											 }};
	const CommandValue<const int> DEVICE_TYPE_COMMAND{{"Device type", "#device-type", DEVICE_TYPES_HELP, SaveRequired::YES, RestartRequired::YES, SettingType::Number}, [this](const int value) -> bool
													  {
														  return executeValue<const int>(value, [this](const int value) -> bool
																						 { return m_settingsFactory->changeDeviceType(value); }, SaveRequired::YES);
													  }};
	const CommandValue<const int> LOG_LEVEL{{"Log level", "#log-level", LOG_LEVEL_HELP, SaveRequired::YES, RestartRequired::NO, SettingType::Number}, [this](const int value) -> bool
											{
												return executeValue<const int>(value, [this](const int value) -> bool
																			   {
			if(value > (int)LogLevel::VERBOSE || value < 0) {
				LogHandler::error(Tags::SystemCommand, "Invalid value: %ld. Valid log levels are %s", value, LOG_LEVEL_HELP);
				return false;
			}
			return m_settingsFactory->setValue(LOG_LEVEL_SETTING, value) != SettingFile::NONE; }, SaveRequired::YES);
											}};
	const CommandValue<const char *> ADD_LOG_INCLUDE{{"Add log include", "#add-log-include", "Adds a tag to the log includes", SaveRequired::YES, RestartRequired::NO, SettingType::String}, [this](const char *value) -> bool
													 {
														 return executeValue<const char *>(value, [this](const char *value) -> bool
																						   {
			uint32_t tag_masks = 0;
			if (Tags::from_str(value, tag_masks))
			{
				LogHandler::error(Tags::SystemCommand, "Invalid value(s): %s", value);
				return false;
			}
			LogHandler::addIncludes(tag_masks);
			return m_settingsFactory->setValue(LOG_INCLUDETAGS, LogHandler::getIncludesAsString().c_str()) != SettingFile::NONE; }, SaveRequired::YES);
													 }};
	const CommandValue<const char *> REMOVE_LOG_INCLUDE{{"Remove log include", "#remove-log-include", "Removes a tag from the log includes", SaveRequired::YES, RestartRequired::NO, SettingType::String}, [this](const char *value) -> bool
														{
															return executeValue<const char *>(value, [this](const char *value) -> bool
																							  {
			uint32_t tag_masks = 0;
			if (Tags::from_str(value, tag_masks))
			{
				LogHandler::error(Tags::SystemCommand, "Invalid value(s): %s", value);
				return false;
			}
			LogHandler::removeIncludes(tag_masks);
			return m_settingsFactory->setValue(LOG_INCLUDETAGS, LogHandler::getIncludesAsString().c_str()) != SettingFile::NONE; }, SaveRequired::YES);
														}};
	const CommandValue<const char *> ADD_LOG_EXCLUDE{{"Add log exclude", "#add-log-exclude", "Adds a tag to the log excludes", SaveRequired::YES, RestartRequired::NO, SettingType::String}, [this](const char *value) -> bool
													 {
														 return executeValue<const char *>(value, [this](const char *value) -> bool
																						   {
			uint32_t tag_masks = 0;
			if (Tags::from_str(value, tag_masks))
			{
				LogHandler::error(Tags::SystemCommand, "Invalid value(s): %s", value);
				return false;
			}
			LogHandler::addExcludes(tag_masks);
			return m_settingsFactory->setValue(LOG_EXCLUDETAGS, LogHandler::getExcludesAsString().c_str()) != SettingFile::NONE; }, SaveRequired::YES);
													 }};
	const CommandValue<const char *> REMOVE_LOG_EXCLUDE{{"Remove log exclude", "#remove-log-exclude", "Removes a tag from the log excludes", SaveRequired::YES, RestartRequired::NO, SettingType::String}, [this](const char *value) -> bool
														{
															return executeValue<const char *>(value, [this](const char *value) -> bool
																							  {
			uint32_t tag_masks = 0;
			if (Tags::from_str(value, tag_masks))
			{
				LogHandler::error(Tags::SystemCommand, "Invalid value(s): %s", value);
				return false;
			}
			LogHandler::removeExcludes(tag_masks);
			return m_settingsFactory->setValue(LOG_EXCLUDETAGS, LogHandler::getExcludesAsString().c_str()) != SettingFile::NONE; }, SaveRequired::YES);
														}};
	const CommandValue<const char *> MOTION_PROFILE_NAME{{"Motion profile set by name", "#motion-profile-name", "Sets the current running profile by name", SaveRequired::NO, RestartRequired::NO, SettingType::String}, [this](const char *value) -> bool
														 {
															 return validateMaxLength("Motion profile name", value, MAX_MOTION_PROFILE_NAME_LENGTH, false, [](const char *value) -> bool
																					  {
			SettingsHandler::setMotionProfileName(value);
			return true; });
														 }};
	const CommandValue<const int> MOTION_PROFILE_SET{{"Motion profile set by number", "#motion-profile-set", "Sets the current running profile by number", SaveRequired::NO, RestartRequired::NO, SettingType::Number}, [this](const int value) -> bool
													 {
														 return validateGreaterThanZero("Motion profile", value, [this](int value) -> bool
																						{
			int profileAsIndex = value - 1;
			if(profileAsIndex > MAX_MOTION_PROFILE_COUNT) {
				LogHandler::error(Tags::SystemCommand, "Motion profile %ld does not exist", profileAsIndex);
				return false;
			}
			SettingsHandler::setMotionProfile(profileAsIndex);
			return true; });
													 }};
	const CommandValue<const char *> EDGE{{"Edge", "#edge", "Outputs the edge pressed command to external application", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this](const char *in) -> bool
										  {
											  if (m_externalCommandCallback)
											  {
												  m_externalCommandCallback(in);
											  }
											  return true;
										  }};
	const CommandValue<const char *> LEFT{{"Left", "#left", "Outputs the left pressed command to external application", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this](const char *in) -> bool
										  {
											  if (m_externalCommandCallback)
											  {
												  m_externalCommandCallback(in);
											  }
											  return true;
										  }};
	const CommandValue<const char *> RIGHT{{"Right", "#right", "Outputs the right pressed command to external application", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this](const char *in) -> bool
										   {
											   if (m_externalCommandCallback)
											   {
												   m_externalCommandCallback(in);
											   }
											   return true;
										   }};
	const CommandValue<const char *> OK{{"Ok", "#ok", "Outputs the ok pressed command to external application", SaveRequired::NO, RestartRequired::NO, SettingType::NONE}, [this](const char *in) -> bool
										{
											if (m_externalCommandCallback)
											{
												m_externalCommandCallback(in);
											}
											return true;
										}};
	const CommandValue<const char *> SETTING{{"Setting", "#setting", "Modify a setting ex. #setting:<name>:<value>", SaveRequired::YES, RestartRequired::NO, SettingType::String}, [this](const char *value) -> bool
											 {
												 CommandValuePair valuePair;
												 if (!getCommandValue(value, valuePair))
													 return false;
												 const Setting *setting = m_settingsFactory->getSetting(valuePair.command);
												 if (!setting)
												 {
													 return false;
												 }
												 return executeValue<const char *>(value, [this, setting, valuePair](const char *value) -> bool
																				   {

