jcfain/TCodeESP32/ESP32/src/messages/SystemCommandHandler.h
			LogHandler::debug(Tags::SystemCommand, "Searching for setting command '%s' value: '%s'", valuePair.command, valuePair.value);
			bool error = false;
			switch(setting->type) {
				case SettingType::String: {
					if(m_settingsFactory->setValue(setting->name, valuePair.value) != SettingFile::NONE) {
						return true;
					}
				}
				break;
				case SettingType::Number: {
					int value = getInt(valuePair.value, error);
					if(error)
						return false;
					if(m_settingsFactory->setValue(setting->name, value) != SettingFile::NONE) {
						return true;
					}
					LogHandler::debug(Tags::SystemCommand, "value: %d", value);
				}
				break;
				case SettingType::Float: {
					float value = getFloat(valuePair.value, error);
					if(error)
						return false;
					if(m_settingsFactory->setValue(setting->name, value) != SettingFile::NONE) {
						return true;
					}
					LogHandler::debug(Tags::SystemCommand, "value: %f", value);
				}
				break;
				case SettingType::Double: {
					double value = getDouble(valuePair.value, error);
					if(error)
						return false;
					if(m_settingsFactory->setValue(setting->name, value) != SettingFile::NONE) {
						return true;
					}
					LogHandler::debug(Tags::SystemCommand, "value: %f", value);
				}
				break;
				case SettingType::Boolean: {
					bool value = getBoolean(valuePair.value, error);
					if(error)
						return false;
					if(m_settingsFactory->setValue(setting->name, value) != SettingFile::NONE) {
						return true;
					}
					LogHandler::debug(Tags::SystemCommand, "value: %d", value);
				}
				break;
				case SettingType::ArrayString: {
				}
				break;
				case SettingType::ArrayInt: {
				}
				break;
				default:
					LogHandler::error(Tags::SystemCommand, "Invalid setting type: %ld", (int)setting->type);
			}
			return false; }, SaveRequired::YES, setting->isRestartRequired);
											 }};

	Command saveCommands[2]{
		SAVE,
		DEFAULT_ALL,
	};

	Command commands[19] = {
		HELP,
		AVAILABLE_SETTINGS,
		PRINT_MEMORY,
		RESTART,
		REAPPLY_PWM,
		PRINT_IP,
		CLEAR_LOGS_INCLUDE,
		CLEAR_LOGS_EXCLUDE,
		CHANNEL_RANGES_ENABLE,
		CHANNEL_RANGES_DISABLE,
		CHANNEL_RANGES_TOGGLE,
		MOTION_ENABLE,
		MOTION_DISABLE,
		MOTION_TOGGLE,
		MOTION_PROFILE_CYCLE,
		PAUSE,
		RESUME,
		PAUSE_TOGGLE,
		MOTION_HOME};

	CommandValue<const int> commandNumberValues[5] = {
		LOG_LEVEL,
		BOARD_TYPE,
		DEVICE_TYPE_COMMAND,
		MOTION_PROFILE_SET,
		MOTION_HOME_SPEED};

	CommandValue<const char *> commandCharValues[8] = {
		WIFI_SSID,
		WIFI_PASS,
		ADD_LOG_INCLUDE,
		REMOVE_LOG_INCLUDE,
		ADD_LOG_EXCLUDE,
		REMOVE_LOG_EXCLUDE,
		MOTION_PROFILE_NAME,
		SETTING};
	CommandValue<const char *> commandExternal[4] = {
		EDGE,
		LEFT,
		RIGHT,
		OK};
	// std::vector<CommandValue<const char*>> commandStringSetting;
	// std::vector<CommandValue<int>> commandIntSetting;
	// std::vector<CommandValue<float>> commandFloatSetting;
	// std::vector<CommandValue<double>> commandDoubleSetting;
	// std::vector<CommandValue<bool>> commandBooleanSetting;

	// void setupSettingsCommands() {

	// 	auto allSettings = m_settingsFactory->AllSettings;

	//     for(SettingFileInfo* settingsInfo : allSettings)
	//     {
	// 		for(const Setting& setting : settingsInfo->settings)
	// 		{
	// 			switch(setting.type) {
	// 				case SettingType::String: {
	// 					// const CommandValue<const char*> command{{setting.friendlyName, commandValue, setting.description, SaveRequired::YES, setting.isRestartRequired, setting.type}, [this, setting](const char* in) -> bool {
	// 					// 	return m_settingsFactory->setValue(setting.name, in) != SettingFile::NONE;
	// 					// }};
	// 					auto command = setupSettingsCommand<const char*>(setting);
	// 					commandStringSetting.push_back(command);
	// 				}
	// 				break;
	// 				case SettingType::Number: {
	// 					auto command = setupSettingsCommand<int>(setting);
	// 					commandIntSetting.push_back(command);
	// 				}
	// 				break;
	// 				case SettingType::Float: {
	// 					auto command = setupSettingsCommand<float>(setting);
	// 					commandFloatSetting.push_back(command);
	// 				}
	// 				break;
	// 				case SettingType::Double: {
	// 					auto command = setupSettingsCommand<double>(setting);
	// 					commandDoubleSetting.push_back(command);
	// 				}
	// 				break;
	// 				case SettingType::Boolean: {
	// 					auto command = setupSettingsCommand<bool>(setting);
	// 					commandBooleanSetting.push_back(command);
	// 				}
	// 				break;
	// 				case SettingType::ArrayString: {
	// 				}
	// 				break;
	// 				case SettingType::ArrayInt: {
	// 				}
	// 				break;
	// 				default:
	// 					LogHandler::error(Tags::SystemCommand, "Invalid setting type: %ld", (int)setting.type);
	// 			}
	// 		}
	//     }
	// }
	template <typename T>
	const CommandValue<T> setupSettingsCommand(const Setting &setting)
	{
		const CommandValue<T> command{setting, [this, setting](T in) -> bool
									  {
										  return executeValue<T>(in, [this, setting](T value) -> bool
																 {
				if(m_settingsFactory->setValue(setting.name, value) != SettingFile::NONE) {
					return true;
				}
				return false; }, SaveRequired::YES);
									  }};
		return command;
	}

	void writeTCode(const char tcode[MAX_COMMAND])
	{
		if (tCodeQueue)
			xQueueSend(tCodeQueue, tcode, 0);
	}

	struct CommandValuePair
	{
		const char *command;
		const char *value;
	};

	bool getCommandValue(const char *in, CommandValuePair &valuePair)
	{
		// Commands with values
		int indexofDelim = getposition(in, strlen(in), DELEMITER_VALUE);
		if (indexofDelim == -1)
		{
			LogHandler::error(Tags::SystemCommand, "Invalid command format: '%s' missing colon, correct format is #<command>:<value>", in);
			xSemaphoreGive(xMutex);
			return false;
		}
		const char *commandAlone = substr(in, 0, indexofDelim);
		if (!strlen(commandAlone))
		{
			LogHandler::error(Tags::SystemCommand, "Invalid command format: '%s' missing command, correct format is #<command>:<value>", in);
			xSemaphoreGive(xMutex);
			return false;
		}
		valuePair.command = commandAlone;
		const char *valueAlone = substr(in, indexofDelim + 1, strlen(in));
		if (!strlen(valueAlone))
		{
			LogHandler::error(Tags::SystemCommand, "Invalid command format: '%s' missing value, correct format is #<command>:<value>", in);
			xSemaphoreGive(xMutex);
			return false;
		}
		valuePair.value = valueAlone;
		return true;
	}

	int getInt(const char *value, bool &error)
	{
		if (!isStringIntegral(value))
		{
			LogHandler::debug(Tags::SystemCommand, "getInt '%s' not integral", value);
			error = true;
			return false;
		}
		return (int)(String(value).toInt());
	}
	float getFloat(const char *value, bool &error)
	{
		if (!isStringIntegral(value))
		{
			LogHandler::debug(Tags::SystemCommand, "getFloat '%s' not integral", value);
			error = true;
			return false;
		}
		return String(value).toFloat();
	}
	double getDouble(const char *value, bool &error)
	{
		if (!isStringIntegral(value))
		{
			LogHandler::debug(Tags::SystemCommand, "getDouble '%s' not integral", value);
			error = true;
			return false;
		}
		return String(value).toDouble();
	}
	bool getBoolean(const char *value, bool &error)
	{
		if (!strcmp(value, "true"))
		{
			return true;
		}
		if (!strcmp(value, "false"))
		{
			return false;
		}
		uint8_t valueInt = getInt(value, error);
		if (error)
		{
			LogHandler::debug(Tags::SystemCommand, "getBoolean '%s' not integral", value);
			return false;
		}
		if (valueInt == 0 || valueInt == 1)
			return (bool)valueInt;
		error = true;
		return false;
	}

