jcfain/TCodeESP32/ESP32/src/messages/SystemCommandHandler.h
	bool isStringIntegral(const char *value)
	{
		int len = strlen(value);
		if (!len)
			return false;
		char firstChar = value[0];
		bool firstCharIsNegative = firstChar == '-';
		bool firstCharIsDecimal = firstChar == '.';
		if ((firstCharIsNegative || firstCharIsDecimal) && len > 1)
		{
			firstChar = value[1];
		}
		return firstChar == '0' || firstChar == '1' || firstChar == '2' || firstChar == '3' || firstChar == '4' || firstChar == '5' || firstChar == '6' || firstChar == '7' || firstChar == '8' || firstChar == '9';
	}

	bool execute(std::function<bool()> function, SaveRequired isSaveRequired = SaveRequired::NO, RestartRequired isRestartRequired = RestartRequired::NO)
	{
		bool subValidate = function();
		if (subValidate)
		{
			completeCommand(isRestartRequired, isSaveRequired);
		}
		xSemaphoreGive(xMutex);
		return subValidate;
	}

	template <class T>
	bool executeValue(T value, std::function<bool(T)> function, SaveRequired isSaveRequired = SaveRequired::NO, RestartRequired isRestartRequired = RestartRequired::NO)
	{
		bool subValidate = function(value);
		if (subValidate)
		{
			completeCommand(isRestartRequired, isSaveRequired);
		}
		xSemaphoreGive(xMutex);
		return subValidate;
	}

	bool validateBool(const char *name, bool value, bool currentValue, std::function<bool(bool value)> function, SaveRequired isSaveRequired = SaveRequired::NO, RestartRequired isRestartRequired = RestartRequired::NO)
	{
		if (value && currentValue)
		{
			Serial.println("Already on!");
			xSemaphoreGive(xMutex);
			return false;
		}
		if (!value && !currentValue)
		{
			Serial.println("Already off!");
			xSemaphoreGive(xMutex);
			return false;
		}
		bool subValidate = function(value);
		if (subValidate)
		{
			printNewState(name, value);
			completeCommand(isRestartRequired, isSaveRequired);
		}
		xSemaphoreGive(xMutex);
		return subValidate;
	}

	bool validateGreaterThanZero(const char *name, int value, std::function<bool(int value)> function, SaveRequired isSaveRequired = SaveRequired::NO, RestartRequired isRestartRequired = RestartRequired::NO)
	{
		if (value < 1)
		{
			Serial.printf("Invalid value: %d.", value);
			xSemaphoreGive(xMutex);
			return false;
		}
		bool subValidate = function(value);
		if (subValidate)
		{
			printNewState(name, value);
			completeCommand(isRestartRequired, isSaveRequired);
		}
		xSemaphoreGive(xMutex);
		return subValidate;
	}
	bool validateGreaterThanNegativeOne(const char *name, int value, std::function<bool(int value)> function, SaveRequired isSaveRequired = SaveRequired::NO, RestartRequired isRestartRequired = RestartRequired::NO)
	{
		if (value < 0)
		{
			Serial.printf("Invalid value: %d.", value);
			xSemaphoreGive(xMutex);
			return false;
		}
		bool subValidate = function(value);
		if (subValidate)
		{
			printNewState(name, value);
			completeCommand(isRestartRequired, isSaveRequired);
		}
		xSemaphoreGive(xMutex);
		return subValidate;
	}

	bool validateMaxLength(const char *name, const char *value, int maxLen, bool valueSensitive, std::function<bool(const char *value)> function, SaveRequired isSaveRequired = SaveRequired::NO, RestartRequired isRestartRequired = RestartRequired::NO)
	{
		if (strlen(value) > maxLen)
		{
			Serial.printf("Invalid command: %s max length is: %d\n", name, maxLen);
			xSemaphoreGive(xMutex);
			return false;
		}
		bool subValidate = function(value);
		if (subValidate)
		{
			if (!valueSensitive)
				printNewState(name, value);
			else
				Serial.printf("%s changed to a value of %d length\n", name, strlen(value));
			completeCommand(isRestartRequired, isSaveRequired);
		}
		xSemaphoreGive(xMutex);
		return subValidate;
	}

	void printNewState(const char *name, const char *newValue)
	{
		Serial.printf("%s changed to: %s\n", name, newValue);
	}
	void printNewState(const char *name, int newValue)
	{
		Serial.printf("%s changed to: %d\n", name, newValue);
	}
	void printNewState(const char *name, bool newValue)
	{
		Serial.printf("%s %s\n", name, newValue ? "enabled" : "disabled");
	}
	void printNewState(const char *name, float newValue)
	{
		Serial.printf("%s changed to: %f\n", name, newValue);
	}
	void completeCommand(RestartRequired isRestartRequired, SaveRequired isSaveRequired)
	{
		if ((int)isSaveRequired)
			Serial.println("Execute the command '$save' to store the new value otherwise the value will reset upon reboot.");
		if ((int)isRestartRequired)
		{
			Serial.println("Restart is required after save");
		}
	}
	void printCommandHelp()
	{
		char buf[MAX_COMMAND] = {0};
		Serial.println();
		Serial.println();
		Serial.println();
		Serial.println();
		Serial.println("Available commands:");
		Serial.println();
		for (Command command : saveCommands)
		{
			formatPrintCommand(command, buf, sizeof(buf));
		}
		strcat(buf, "\n");
		for (Command command : commands)
		{
			formatPrintCommand(command, buf, sizeof(buf));
		}
		for (auto command : commandExternal)
		{
			formatPrintCommand(command, buf, sizeof(buf));
		}
		for (auto command : commandCharValues)
		{
			formatPrintCommand(command, buf, sizeof(buf));
		}
		for (auto command : commandNumberValues)
		{
			formatPrintCommand(command, buf, sizeof(buf));
		}
	}

	void printAvailableSettings()
	{
		Serial.println();
		Serial.println();
		Serial.println();
		Serial.println();
		Serial.println("Available settings:");
		Serial.println();
		char buf[MAX_COMMAND] = {0};

		auto allSettings = m_settingsFactory->AllSettings;

		for (SettingFileInfo *settingsInfo : allSettings)
		{
			for (const Setting &setting : settingsInfo->settings)
			{
				formatPrintCommand(setting, buf, sizeof(buf));
			}
		}
	}

	void formatPrintCommand(const Setting &setting, char *buf, const size_t &len)
	{
		buf[0] = {0};
		formatCommand(setting.name, setting.friendlyName, setting.type, buf);
		Serial.print(buf);
	}

	void formatPrintCommand(const CommandBase &command, char *buf, const size_t &len)
	{
		buf[0] = {0};
		formatCommand(command.command, command.description, command.valueType, buf);
		Serial.print(buf);
	}

	void formatCommand(const char *command, const char *description, const SettingType &valueType, char *buf)
	{
		char temp[MAX_COMMAND] = {0};
		switch (valueType)
		{
		case SettingType::Number:
			snprintf(temp, MAX_COMMAND, "%s%s", command, ":<int>");
			break;
		case SettingType::Boolean:
			snprintf(temp, MAX_COMMAND, "%s%s", command, ":<bool/bit>");
			break;
		case SettingType::String:
			snprintf(temp, MAX_COMMAND, "%s%s", command, ":<string>");
			break;
		case SettingType::Double:
			snprintf(temp, MAX_COMMAND, "%s%s", command, ":<double>");
			break;
		case SettingType::Float:
			snprintf(temp, MAX_COMMAND, "%s%s", command, ":<float>");
			break;
		default:
			snprintf(temp, MAX_COMMAND, "%s%s", command, "");
			break;
		}
		sprintf(temp, "%-40s", temp);
		std::replace(temp, temp + strlen(temp), ' ', '-');
		strcat(buf, temp);
		sprintf(temp, "%s\n", description);
		strcat(buf, temp);
	}
};